//~ copyWidthin方法是将一段原数组里面的值复制到原数组的某一段位置，将会改变原数组，数组的长度不变
//~ copyWidthin方法的参数有3个，第一个是复制的位置，第二个是要复制的开始位置，第三个是复制结束的位置（不包括）

var a = [1, 2, 3, 4, 5, 6]
console.log(a.copyWithin(0, 4, 5)) //~ [ 5, 2, 3, 4, 5, 6 ] 这里是将索引位置为4，值为5的项复制到了索引为0的位置上

var b = [1, 2, 3, 4, 5, 6]
console.log(b.copyWithin(1)) //~ [ 1, 1, 2, 3, 4, 5 ]   如果copyWidthin的开始索引和结束索引都为没填的的话，将在指定位置将原数组复制一遍

var c = [1, 2, 3, 4, 5, 6]
console.log(c.copyWithin(1, 4)) //~ [ 1, 5, 6, 4, 5, 6 ] 如果copyWidthin的结束没填的话，将以开始索引的值往后复制

var d = [1, 2, 3, 4, 5, 6]
console.log(d.copyWithin(1, -2, -1)) //~ [ 1, 5, 3, 4, 5, 6 ] 如果索引为负的话则加上数组长度就行了
